-----------------------------------------------------------------------------------------
--
-- main.lua
-- Created by: Taisei S
-- Date: May. 5th, 2018
-- Description: This calls the splash screen of the app to load itself.
-----------------------------------------------------------------------------------------

-- Hiding Status Bar
display.setStatusBar( display.HiddenStatusBar )

-----------------------------------------------------------------------------------------

-- Use composer library
local composer = require( "composer" )

-----------------------------------------------------------------------------------------

    -- Path for the file to read
    path = system.pathForFile( "volume.txt", system.DocumentsDirectory )
 
    -- Open the file handle
    file, errorString = io.open( path, "r" )
 
    if not file then
        -- Error occurred; output the cause

        print( "File error: " .. errorString )

        file = io.open( path, "w+" )

        file:write( "5" )
        io.close( file )
        file = io.open( path, "r")
        local contents = file:read( "*n" )
        userVolume = contents
        io.close( file )
    else
        -- Read data from file
        local contents = file:read( "*n" )
        -- Output the file contents
        print( "Contents of " .. path .. "\n" .. contents )
        -- Sets SetVolume to contents of read file
        userVolume = contents
        -- Close the file handle
        io.close( file )
    end
    print ("***userVolume= " .. userVolume)
    file = nil


print(I̛͕̲̩̟̭̣̙͍͍̰̻̯̤̫ͤͥ͛̄̏ͥͬ͌͡t̶̸̠̝̩̲̻̣͈̮̥̬͉̲̙̻̺͈̞ͤ̃̇͠͡ͅ'͌̓ͥͦͤ̋ͬ̚͘͜͞͏͎̤̹̻̹̝̪͕̮͖͖̰̹͔̝̗̦̹͘ș̢̢̯̤̭͇̭̩̈́ͣ͊͆͆̏̆̌͂ͣͥ͌ͩͦ͆̆ͣ͞ ̡͑̓ͦ̀̏̕͡͏̵͕̹̼̖̭͈͚̞ͅạ̢̤͓͎͙̣̦̘̦̥͖̾ͨ͛̓͑ͫͥ͗͒͆͆ͨ̄͒ͣͥ̆͂͜l̸̷͎͖̭̮̞̥̺̲̖̠̳̃ͣͭ͐̂ͥ̍̔̚͠l͚̭̯͉̠͓̣͙̲̝̲͎̃̌̽͐̽́̐̇̔̌̃͒͘͠ ͩ̓ͦ͌̅҉̛̲̬̦͎̰͉̰o͚̘̩̰͚̲̼͇͇̳̾̆ͪͮͤ͘͟͞͞ğͦ̃ͫ̉ͦ̊̔̇ͧ̓̋̌̈́̔̑̽̏͏̢̩͙̻̮̥̭̣̯͈̳͎͘͜ͅr͙̖͕̫̹̹̋ͩͫͩ̓̆ͫ͘͟e̵ͨ̽͛ͯ͞͞͏͚̬̤͚ ͊ͭ̾̓̈̒̎́̋ͪ̈́ͭ̓͑ͫ̐̔҉̷̴͎̩̞̲͍̭̼̦̝̪͓̺̰̙̖̮͞n̪̬̲̜̹̜̖̬̱͕ͬ̓͗̈́̍̿̋ͪ͂̑ͭ̕͡ö̷̵̧̙̥̪̦̬ͥ̿̈ͭẅ̸͓̺̥̱̟̖̣̼̱̟̼̠̦́͗̽ͧ͌͂̑ͨ̾̔̐̕͟͞,͛̇͆̃̈̔̀̓̔ͪ̀҉҉̣̟̮̝̰̤̱͇̟ ̭̪̩̫͉̟͈͚͇̣͖͈̼̗͖̲͇̽͋̊ͣͨ͘͘ͅM̧̛̲̲̼̼̞͔̰̦̱̲͇ͧ͋̏ͧ͛͋͆͋ͫ̔̽ͮͬ̈́͛̓̚͜͝ͅr̸̔̏͐̈́̊̽̍̋̋ͯ́̚͏̬̗̭̻.̷̛̼͇̜̟̺̎̍̃͂͋ͮ̉́ ̋̏̊ͩͨ̓ͣͥ̓̚͏̙̥̜͈̘̯͕͜ͅḎ͖̳̯̥̘̬̺͖̭̈͊͑̎̇̑̓̒͑̀ͫͯ̃ͮ͘͟u̶̙̝͇̘ͥ̔̓͐̔̄͒̎̿͆̾̾ͯ̃ͭ̃̓̿́͜͠n̛̯̠̪̳͎̘̲͈̱̮̣̗̬͍̺̙̹̓ͬ͒͛̅k̈́ͯ̍̆̑̕͡͡͏̤̣͕͖̘̟͖ę̡̲̜͎͙͕̔͒ͤ̅̒ͯ̿̅́͑ͅy̢̥̙͙̝̺̤̮̫̯̭̩̱̣ͮ̽ͨͪ̈ͫͩ͗ͣ̚.̴̛̬̫̗͇͎͔̜̝͍̼͓̘̙̮̑ͫ͂͐ͫ̉ͭ̒̋͛̑ͅ ̢̛͓̲͉̭͙ͣͫ̑̏͗ͬ͗N̟̯͖̯̳̜̙̻̺͎̫̜ͥ͊ͮͪ̾͒̀ͅó̡̻̲͎̹͙̞̤̜̜͇ͫ̿̽ͣ̽̌̏́̚ͅt̢̯̣̳̜͓͍̻̻̜̟͋̎̑ͭ̾͛͑̽̐͡ ̧̗͎̺̻̜͇ͮ̑̐̾̎͐̌͜e̽̿ͮ̍̄̓̑͑͋̊͐̈́҉̷̟̠̮̥͖͓̯̜̦̻̳̟͈̪̠̼̕ͅͅv̸̛̖̗̘̭̙̺̬͚̫̰̏̒́̈̈̿̋̓̅ͨ̎͟͟ͅē̸̪͎̟̳̘̖͍͍͕̣̩̄̾͑̔ͭ͑́͋̒̓́̚͘͟͢n̶͔̺̗͉͈̱͖̥̪̟̜̞̩̥̼̯̳̭̓͊̐̍ͫ͂̊̔ͧ̊̊͢ ̋̐ͤ͛ͩ͊ͮ͂͏̶̶͉̪̫̠̩͖͇̯̞̭̙͚͉̩͔̦̤͘͠y̸̛͌̎̋̈̓͆͆̀̋ͨ̂̾̉̋̈ͤ̀͟͏̝͇̜̘̹̰͕͕͎͖̳̦͚̩̼͙o͓̯̫̙̱̥͎̜͓͚ͥ̑ͪ̀ͨ̏̈́̊͂ͧ̑̎͐͊̾̽͘̕͢u̿͆̅̃͛̆͋ͫ̐͏͕̻̠̘̰̟̻͖rͨ͂̃ͨ͛͛͌͌̎̃̉͆͗ͦ̈ͣ̓ͣ҉̦̠̦͍̩̯ ͂̇ͬ̇ͨ̀̾̒ͥ͗̚͏̴̧̡̳̯̟̙̙̞ͅĮ̙͙͈̻̘̺͚̟̪̻̪̥͍̤̱͍̇́͋͐͛ͥ͆́̾͆̓̏͐͒ͧͬ͆̓͗́́̕͘ͅͅń̴̷̙̳̻̘̖̮̭̬͔͍͑ͦ͋̑̀̓͌̎̀͜͠f̂̉̈͆̂͑͛͌̏̐̂̂ͫ҉̡̞̩̰͖̖̕ī̸̶̹͍̳̭̤̫̳͙͔̗̞ͧͣ̊ͪ̾͗ͬ̈́͗̅̉̇̓͢͡͞ǹ̛̗̖̺̠͇͔͔̞̗͇̯̣̩̖̉̌̚͘͘͞i̷̴̺̦͙̦̠̱̣̤̺͓̮̩̬͚͈̩̱̭̹͐ͧͤ̓ͩͭ̿͒̐͒̓̓͋̌̉t̨͉̫̺̺̤͕̼̜̬̙̗̲̭͇̠͇͐ͨ̑̓̓̏̈͒ͩ̀͢͠͞y̨̨ͯ̑̋̈̐ͪ̅͛͊ͥ̽̽̈́͂͢҉̮̱͉̮̣͉̩̼̱̫ͅ ̶̢̯̬̦͔͖̝̫͖̲̗̰͇̳̬̞͈͂̌ͩ͛ͤͬ̄ͮ̿̕͜ͅͅĜ̢̛̛̞̫̹͓̫̺̳͎̱͇͉̄̒̃͗ͪͯ̏̂ͦ̅̍ͪͮ́͝a̸̷̛͓̯̰̗̅̏̉̒ͥ̓̋̐͂͋̐̉ͥ͝ư̧͇̱͇̬͚̳̹̮̩̩̥̝̦̼͙̯͆̽̈́̉̋̌͟͞͞ǹ̛̯̺̥̙̝̣ͭ̾͑̀ͭͯ͂̏̃̃ͮ͌̎͒ͣͬ́͜͠͝tͤͪ͊̚̕͠͞҉͔̭̬̤̬̻l̵̍͊͒̃̌̀̈̆́̽̓͂͗ͪ̎͆͐̾̄͞͞͏̘͉̙̭̘̜̣̗͈̖̗̣̜̦̫̭̻̱̘e̝̖͈͔͎̊̔ͥ̈́̌ͩ̍̐͟͞t̋ͣͤ͑̊͏̨̘̩̙̟͇̘͜ ̧̼̰̣̃̄̇̉ͮ̉̏ͦ̋́͛̐̈́̔̚͢͝c̺͔͙̤̙̝̭̰͕͚̦̭͓̜̼̹̗͗ͪ̐̕a̵̛̝̳̥͙̖͈̥̩͚͎̋ͣ͛̓͐͌͂̅͝ͅņ͔͚̤͈͙͖̦̣̫̜͙͖̩̫͈̣̪ͩ͊̈́̔́ͩ̉̈̀̚͟͢͟ͅ ̴̸̢̛̝̫͈̣̘̗͙̳̪̠̟̤͉̫͈͍̪̻͕͒ͦ̄̈ͧͥ̑̍͗ͤͨͬͨ̽̂ͫͬ̿͋̀ś̢̛̗̲̭̣͕̺̼̳̤̳̞̦̠̄̋̍ͣͨͨ̈́̆̓̒͂ͅț̢̣̭̘̻̙͒̒ͮͩ̏͂ͧ̓ͤͫ̍ͤ̄̆̇̓̄̚̕ơͪͮ̒ͧ̌̏̆́҉̟̠̥͓̳̝̬p̡̡̰̭͕̰ͧ̔̒̂̈̓̃͌̋̈ͤ̇̉̎̀͡ ̢̨͎̰̩̭̼̬̗̞͙̥̘̯̘̹̪̼͂ͣ̉ͥͯ̂ͦ͛ͦ̒̚͢͠͠M̴̳͖͕͈̗͓̲͉̖̱͔̝̜͊ͮ͛̄̒ͧ͊̈́̚ŗ̜̰̮̰̼̥͇͍̺̣̪̳̋̅ͥͧ̑̈́ͦ̿́̈ͫ̄ͫ́̕ͅ.̶̢̎ͤͫͭ̎͊̀ͮ̇̓ͥ̓͝͏̘̝͇͙͉̜̹͍̗͙̺͉͍̝̩̭̠͢ ̸̾͋̀͗̽͊̊ͫ̕͏̤͍̱͉̥̭̠̖͎̪̺̙̖͉̙͉͘G̛ͭ̀̅̈́̒ͦͪ̄̑̅͛ͧ̄̚͏̵̺͙̣͓̖̮͕͖̹ͅa̶̢̱͓͖̘̺͎̲͈̫͔̣͇͑ͧ̍̿͛m̶̸̧͉̟̫̣̻̝̦̼͔͔̝͎̙̼̟͍̺̈̇ͥ̒͌̀͜ͅe̵̬̙̰̗͔̘̭̙͇̬̦͇̰ͨ̈́̋̉̆̃̀ͭ̀̽̋̍͘͠ͅ ̸̶̫̤̺̼̬͍̹͙͙̺̘̖͍̣̠͑͆̔̉͌̈́ͣͦͦ̾̿͘͝ͅa͚̙̦̤͎̲͇͉͕̞̜ͭ̄̉̑̀͢͠n͈͉͖͍̪̖̝̜̦̬͇͔̣̭̮ͣͨͤ̏ͥ̋́͘̕ḑ̯͔̖̯̟̦͓̘̪̼͚̬̹̰̝͖̏ͩ̿̂ͥ̂̌̓̒̅̓͐́̚ ̒ͮ̿͑̽̾͛ͯ́ͩ͂̓ͪͭͨ̈̊ͭ͏̣̭̬̗̖͇͈̪̯̣̱̺͈͔́W̶̻̺̳͙̺̙̳̭̜̖̙͚̲͙͈̖͈ͥ̐́͗ͤ̀ͬ̅ͧ̄̑ͥͮ͒́̌͘͟ͅa͗̋̇̾̑͊ͩͨ͐͋̐̿ͣ͘͏̸҉̪̜̫̤̩̗͚̤͎̩̦̫͓̳̲͕͜t̛̲͙̞͎̪̝͖͎̙̥ͫ̽͋͛ͭͣ̀͆̈́̽̐̀ͯͥͩ̎́̕͞c̨̧͈̲̞͈̭̭̖̰̠̱̞͍̘͖̺͕̈́̎̐̓̍́̚ḩ̵͓̬͚̞̘̤̤̥ͧ̓ͯ͒ͩ̃ͦ͒͋͋͊̓ͮͣͮ̿ͫ̒͘͟͟'̮͖̣̥̝̗͕̹̮̥̮͚̼͍͍̬̲̗̊͐ͬ͛̒͋̔͒̎͌̐̏̇̆ͫ̂͘͝ͅs̉͋͒ͬ͋̄ͫ͒͒͌ͬ̀̉ͩ̾̏ͧͭ͠҉̜͈̻̞̬͉̼̭̯̮͍̪́͞ ̶̛̯̟̖̙͉̬̪̏͊ͬͨ̈́͒́͋ͨ̏͑̋͑̅̔ͅŗ̥̥͍̳͉̞͈ͪ̈́ͥ̔ͥ̽̑ͫ̎̈́̂̇̿͊̊́̕͢e̷̎͋̈̐̂ͦͨ̾̽͜͏͏̸̱͎̱̫̦̭̪̺̦̙̹̻̣͎̟į̵̼̯͉̖̻͕͕̱̺̽̈́̄̂̽ͅͅg̛̙̫̟̯̬͇̺͔͎̰̗̝̖̳͈̦̪͑ͨͬ́͜n̶̶̨̮͙͇͉͌̐̿̓ͣ̊̅ ̴̧̡̠͇̩͖͕̯͕̬̜͉̟͓̙̱͚͎̾ͩ̍̾̌̑͗ͫ̇́̊͘͝ö̢̝͎̖̱̝̣̹̲̹̟̼̣͙̲͎́̓̈́̓̑̋̓̊̑̅̅͑ͨ̈̈̌́́̀͠ͅf̻͎̮̗̹͈͓ͭ͐̑̃̔̇̓͋̓̅̆̓̈̇̉̾ͤ̚̕̕ ̶͊̊ͬ̎̍̓̎̈́͛ͦ̅͑͆ͤ̃͏̯̠̤̟͕͖̦͓̩̭̺̩̬̗̯̼͝ͅp̵̧̨̧͐̊ͬ͑̓ͮ̏̽͆ͨ̐̄̍̒͏̭̮̫̦̱̠͔o̘̟͔̟͙̼̜̬͕̠̥͕̳̜͓͓ͤ͗́̈́̽̐ͩ͗̄ͤ̈̈́̚̚͢͠wͬ̈̿ͬ̏ͬ͊̓͛͋̉͆ͮ͊́͏҉̹͎͓̯͔͍͕͉͉̦͔̀ͅé̈ͦ̈́̓͛͗̓̀҉̗͕̦͖̪͙̘͚̩̹̲̭͍̻̀ͅͅṙ̢͍͇̘̯̱̙̞͙͈̺̱͎̪̞̣͔̻̗̊̔ͮͬ̏́ͬͣ́ͅ.̷̰̙̺̪̩͕͓̪͒͗ͦ̅̆̈́̎̇̏̂ͩͫ͊ͭ̄̽̽͒̐́͘͘ ͂͆̌͛ͩ҉̩͈̻̲̬̺̦͇̜͖͉̜͢͠
)

-- Go to the intro screen
composer.gotoScene( "splash_screen" )

